<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<html>
<head>
  <meta name="generator" content="HTML Tidy, see www.w3.org">
  <title>Ludovic Henrio</title>
</head>
<body style="background-color: rgb(144, 170, 239);">

<h2>Titre et r&eacute;sum&eacute; de la th&egrave;se</h2>
Asynchronous Object Calculus:
Confluence and Determinacy <br>
<br>
Calcul d'Objet Asynchrone : Confluence et Determinisme<br>
<br>
<hr style="width: 100%; height: 2px;">
<h2>Abstract:</h2>
The objective of this thesis is to design an object calculus that
allows one to write parallel and distributed applications, particularly
on wide range networks, while ensuring good properties. This calculus
is named ASP: Asynchronous Sequential Processes.<br>
&nbsp;&nbsp;&nbsp; <br>
&nbsp;&nbsp;&nbsp; The main characteristics of ASP are: asynchronous
communications, futures, and a sequential execution within each
process. ASP presents strong confluence and determinism properties,
proved in a context as general as possible within this thesis.<br>
&nbsp;&nbsp;&nbsp; <br>
&nbsp;&nbsp;&nbsp; A first design decision is the absence of sharing:
objects live in disjoint activities. An activity is a set of objects
managed by a unique process and a unique active object. Active objects
are accessible through global/distant references. They communicate
through asynchronous method calls with futures. A future is a global
reference representing a result not yet computed. This thesis models
those aspects, their main properties, and the consequences of these
mechanisms on the deterministic behavior of programs. The main result
consists in a confluence property and its application to the
identification of a set of programs behaving deterministically.<br>
&nbsp;&nbsp;&nbsp; <br>
&nbsp;&nbsp;&nbsp; From a practical point of view, ASP can also be
considered as a model of the ProActive library. This library provides
tools for developing parallel and distributed applications in Java.<br>
<br>
<br>
<h2>R&eacute;sum&eacute; :</h2> &nbsp;&nbsp;&nbsp; L'objectif de cette th&egrave;se est de concevoir un
calcul d'objets permettant d'&eacute;crire des applications parall&egrave;les et
distribu&eacute;es, en particulier dans un cadre &agrave; grande &eacute;chelle, tout en
assurant de bonnes propri&eacute;t&eacute;s. Le calcul propos&eacute; s'intitule ASP :
Asynchronous Sequential Processes.<br> &nbsp;<br> &nbsp;&nbsp;&nbsp; Les principales
caract&eacute;ristiques de ce calcul sont : des communications asynchrones,
la pr&eacute;sence de futurs et une ex&eacute;cution s&eacute;quentielle dans chacun des
processus. Ce calcul exhibe de fortes propri&eacute;t&eacute;s de confluence et de
d&eacute;terminisme. Cette th&egrave;se a donc aussi pour objectif de prouver de
telles propri&eacute;t&eacute;s dans un cadre aussi g&eacute;n&eacute;ral que possible.<br> &nbsp;&nbsp;&nbsp;
<br> &nbsp;&nbsp;&nbsp; ASP est bas&eacute; sur une r&eacute;partition des objets en diff&eacute;rentes
activit&eacute;s disjointes. Une activit&eacute; est un ensemble d'objets g&eacute;r&eacute;s par
un unique processus. Les objets actifs sont des objets accessibles par
des r&eacute;f&eacute;rences globales/distantes.&nbsp; Ils communiquent &agrave; travers des
appels de m&eacute;thodes asynchrones avec un m&eacute;canisme de futurs. Un futur
est une r&eacute;f&eacute;rence globale d&eacute;signant un r&eacute;sultat qui n'est pas encore
calcul&eacute;. Cette th&egrave;se mod&eacute;lise ces diff&eacute;rents aspects, leurs
principales propri&eacute;t&eacute;s et les &nbsp;&nbsp;&nbsp; cons&eacute;quences de ces m&eacute;canismes sur
la notion de comportement d&eacute;terministe des programmes. Le r&eacute;sultat
principal consiste en une &nbsp;&nbsp;&nbsp; propri&eacute;t&eacute; de confluence et son
application &agrave; l'identification d'un ensemble de programmes se
comportant de fa&ccedil;on d&eacute;terministe.<br> &nbsp; <br> Du point de vue pratique,
ASP la biblioth&egrave;que ProActive. Cette librairie Java fournit des outils
pour le d&eacute;veloppement de programmes parall&egrave;les et distribu&eacute;s.

<br>
<ul>
</ul>
</body>
</html>
